---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.Dispose
source: html/85dd2541-33d1-9fc9-4769-73cafd256d3e.htm
---
# Autodesk.Revit.DB.ScheduleField.Dispose Method

Releases all resources used by the ScheduleField

## Syntax (C#)
```csharp
public void Dispose()
```